# Week 3

In [43]:
import pandas as pd

In [44]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

In [45]:
df['Date']=['Decembre','Mai','June']  # here we add a new column
df

         Cost Item Purchased   Name      Date
Store 1  22.5         Sponge  Chris  Decembre
Store 1   2.5   Kitty Litter  Kevyn       Mai
Store 2   5.0          Spoon  Filip      June

In [46]:
# we can also add a boolean column as following :
df['Delivred']=True
df

         Cost Item Purchased   Name      Date Delivred
Store 1  22.5         Sponge  Chris  Decembre     True
Store 1   2.5   Kitty Litter  Kevyn       Mai     True
Store 2   5.0          Spoon  Filip      June     True

In [47]:
# none value:
df['feedback']=['Positive',None,'Negative']
df

         Cost Item Purchased   Name      Date Delivred  feedback
Store 1  22.5         Sponge  Chris  Decembre     True  Positive
Store 1   2.5   Kitty Litter  Kevyn       Mai     True      None
Store 2   5.0          Spoon  Filip      June     True  Negative

In [48]:
idf=df.reset_index()

In [49]:
idf['Date']=pd.Series({0:'Decembre',2:'June'})
idf

     index  Cost Item Purchased   Name      Date Delivred  feedback
0  Store 1  22.5         Sponge  Chris  Decembre     True  Positive
1  Store 1   2.5   Kitty Litter  Kevyn       NaN     True      None
2  Store 2   5.0          Spoon  Filip      June     True  Negative

## Merging dataFrames :

In [50]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name') # if we do not precise the index, pandas will automatically use an index from 0 to ...
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df.head())
print()
print(student_df.head())
#staff_df.head()  to have a table representation

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [51]:
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)  # outer give all

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [52]:
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)  # inner gives the intersection

                 Role       School
Name
James          Grader     Business
Sally  Course liasion  Engineering

In [53]:
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True) # here we get all staff including student with their details

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [54]:
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True) # here we get all student incdung student who are in staff

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [55]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business

In [56]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liasion   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [59]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])
staff_df
student_df
pd.merge(staff_df, student_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

# Idiomatic Pandas: Making Code Pandorable¶

In [60]:
# neet to download data